print("\033[38;2;155;135;12mDarkYellow\033[0m")
print("\033[38;2;180;180;180mGray\033[0m")
print("\033[38;2;100;100;100mDarkGray\033[0m")
print("\033[38;2;0;0;255mBlue\033[0m")
print("\033[38;2;0;255;0mGreen\033[0m")
print("\033[38;2;0;255;255mCyan\033[0m")
print("\033[38;2;255;0;0mRed\033[0m")
print("\033[38;2;255;0;255mMagenta\033[0m")
print("\033[38;2;255;255;0mYellow\033[0m")
print("\033[38;2;255;255;255mWhite\033[0m")

color_codes = [
    "0;0;0",        # Чёрный
    "0;0;255",      # Синий
    "0;255;0",      # Зелёный
    "0;255;255",    # Голубой
    "255;0;0",      # Красный
    "255;0;255",    # Фиолетовый
    "155;135;12",   # Тёмно-жёлтый
    "180;180;180",  # Серый
    "100;100;100",  # Тёмно-серый
    "65;105;255",   # Светло-синий
    "3;192;60",     # Светло-зелёный
    "48;213;200",   # Бирюзовый
    "220;20;60",    # Светло-красный
    "153;102;204",  # Аметистовый
    "255;255;0",    # Жёлтый
    "255;255;255",  # Белый
]

for back in color_codes:
    for text in color_codes:
        print("\033[38;2;{};48;2;{}mТекст\033[0m".format(back, text), end="")
    print()
